fonecmid-diplom/src/Documents/ГрафикОтпусков/ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ОстаткиОтпусковСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонца</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Год = год(ТекущаяДата());
    ГрафикОтпусков.Обновление = Ложь;
    
    Если Параметры.Свойство("АдресДанных") Тогда
        
        ДанныеГрафика = ПолучитьИзВременногоХранилища(Параметры.АдресДанных);
        
        Если ЗначениеЗаполнено(ДанныеГрафика) И ДанныеГрафика.Свойство("Сотрудники") Тогда
            
            КоличествоСотрудников = ДанныеГрафика.Сотрудники.Количество();
            
            ГодДляШкалы = Объект.Год;
            Если Не ЗначениеЗаполнено(ГодДляШкалы) Тогда
                ГодДляШкалы = Год(ТекущаяДата());
            КонецЕсли;
            
            НачалоГодаШкалы = НачалоГода(Дата(ГодДляШкалы, 1, 1));
            КонецГодаШкалы = КонецГода(Дата(ГодДляШкалы, 12, 31));
            
            ГрафикОтпусков.АвтоОпределениеПолногоИнтервала = Ложь;
            ГрафикОтпусков.УстановитьПолныйИнтервал(НачалоГодаШкалы,КонецГодаШкалы);
			
            ГрафикОтпусков.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Месяц;
            ГрафикОтпусков.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.Фиксированная;
            ГрафикОтпусков.КратностьПериодическогоВарианта = 1;
            
            ЭлементыШкалы = ГрафикОтпусков.ОбластьПостроения.ШкалаВремени.Элементы;
                        
            ЭлементМесяц = ЭлементыШкалы.Добавить();
            ЭлементМесяц.Единица = ТипЕдиницыШкалыВремени.Месяц;
            ЭлементМесяц.Формат = "МММ";             

			СерияОтпуск = ГрафикОтпусков.Серии.Добавить();
            СерияОтпуск.Текст = "Отпуск";
            СерияОтпуск.Цвет = Новый Цвет(0, 128, 255);
            
            Для Индекс = 0 По КоличествоСотрудников - 1 Цикл
                
                ИмяСотрудника = ДанныеГрафика.Имена[Индекс];
                ДатаНачала = ДанныеГрафика.ДатыНачала[Индекс];
                ДатаОкончания = ДанныеГрафика.ДатыОкончания[Индекс];
                
                ТочкаСотрудник = ГрафикОтпусков.Точки.Добавить();
                ТочкаСотрудник.Текст = ИмяСотрудника;
                
                Отпуск = ГрафикОтпусков.ПолучитьЗначение(ТочкаСотрудник, СерияОтпуск);
                ИнтервалОтпуск = Отпуск.Добавить();
                ИнтервалОтпуск.Начало = ДатаНачала;
                ИнтервалОтпуск.Конец = КонецДня(ДатаОкончания);
                ИнтервалОтпуск.Текст = ИмяСотрудника;
                
            КонецЦикла;
            
        КонецЕсли;
        
    КонецЕсли;
    
    ГрафикОтпусков.Обновление = Истина;
    
КонецПроцедуры
